Revit 2024 API
FormatOptions.CanSuppressLeadingZeros Method
 Checks whether leading zeros can be suppressed for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool CanSuppressLeadingZeros()
Visual Basic
Public Function CanSuppressLeadingZeros As Boolean
Visual C++
public:
bool CanSuppressLeadingZeros()
Return Value
 True if leading zeros can be suppressed, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
CanSuppressLeadingZeros Overload
Autodesk.Revit.DB Namespace